/*****************************************************************************
 *      ソフトウェアライブラリ
 *
 *      Copyright (c) 1994 SEGA
 *
 * Library: ファイルローダ
 * Module : サンプル１
 * File   : smpfld01.c
 * Date   : 1995-10-02
 * Version: 1.00
 * Auther : N.K
 *
 *      ゲームの単純な起動。
 *
 *****************************************************************************/

/*****************************************************************************
 *      インクルードファイル
 *****************************************************************************/
#include <sega_sys.h>
#include <sega_gfs.h>
#include <fld_load.h>

/*****************************************************************************
 *      定数マクロ
 *****************************************************************************/
/* 同時にオープンするファイルの数 */
#define MAX_OPEN        2

/* ルートディレクトリにあるファイル数 */
#define MAX_DIR         10

/* アクセスするファイル名 */
#define FNAME           "SAMP_IP.BIN"

/*****************************************************************************
 *      関数の宣言
 *****************************************************************************/
/*****************************************************************************
 *      変数の定義
 *****************************************************************************/
/* ライブラリ作業領域 */
Uint32 lib_work[GFS_WORK_SIZE(MAX_OPEN) / sizeof(Uint32)];

/* ディレクトリ情報管理領域 */
GfsDirTbl dirtbl; 

/* ディレクトリ情報格納領域 */
GfsDirName dirname[MAX_DIR];

/*****************************************************************************
 *      関数の定義
 *****************************************************************************/
Sint32 main()
{
    Sint32 ret;
	Sint32 tno = 2;				/* ＣＤ－ＤＡの先頭トラック番号 */

    /* ディレクトリ情報管理領域のsetup */
	*((Uint32 *)GFS_DDS_ADDR) = 0x20202020;
    GFS_DIRTBL_TYPE(&dirtbl) = GFS_DIR_NAME;
    GFS_DIRTBL_DIRNAME(&dirtbl) = dirname;
    GFS_DIRTBL_NDIR(&dirtbl) = MAX_DIR;

    /* ファイルシステムの初期化 */
    ret = GFS_Init(MAX_OPEN, lib_work, &dirtbl);
    if (ret <= 0) {
		/*	失敗すると、自分自身を起動する */
		SYS_Exit(0);
    }

    /* ゲームを起動する */
	ret = FLD_ExecGame(FNAME,tno);
	if (ret == NG) {
		/*	失敗すると、マルチプレイヤーに戻る */
		SYS_Exit(1);
	}
    return 0;
}
